[
    {
        "_id": "6619b43614559a90b1d81519",
        "Company_name": "Apple Inc.",
        "Company_ticker": "AAPL",
        "Closed_price": 175.04,
        "Company_info": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. In addition, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.",
        "Company_PE": 27.5,
        "Company_cash_flow": 116433002496.0,
        "Company_dividend": 0.96,
        "stock_id": 1
    },
    {
        "_id": "6619b43614559a90b1d8151a",
        "Company_name": "Microsoft Corporation",
        "Company_ticker": "MSFT",
        "Closed_price": 427.93,
        "Company_info": "Microsoft Corporation develops and supports software, services, devices and solutions worldwide. The Productivity and Business Processes segment offers office, exchange, SharePoint, Microsoft Teams, office 365 Security and Compliance, Microsoft viva, and Microsoft 365 copilot; and office consumer services, such as Microsoft 365 consumer subscriptions, Office licensed on-premises, and other office services. This segment also provides LinkedIn; and dynamics business solutions, including Dynamics 365, a set of intelligent, cloud-based applications across ERP, CRM, power apps, and power automate; and on-premises ERP and CRM applications. The Intelligent Cloud segment offers server products and cloud services, such as azure and other cloud services; SQL and windows server, visual studio, system center, and related client access licenses, as well as nuance and GitHub; and enterprise services including enterprise support services, industry solutions, and nuance professional services. The More Personal Computing segment offers Windows, including windows OEM licensing and other non-volume licensing of the Windows operating system; Windows commercial comprising volume licensing of the Windows operating system, windows cloud services, and other Windows commercial offerings; patent licensing; and windows Internet of Things; and devices, such as surface, HoloLens, and PC accessories. Additionally, this segment provides gaming, which includes Xbox hardware and content, and first- and third-party content; Xbox game pass and other subscriptions, cloud gaming, advertising, third-party disc royalties, and other cloud services; and search and news advertising, which includes Bing, Microsoft News and Edge, and third-party affiliates. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online, and retail stores. The company was founded in 1975 and is headquartered in Redmond, Washington.",
        "Company_PE": 38.21558,
        "Company_cash_flow": 102646996992.0,
        "Company_dividend": 3.0,
        "stock_id": 2
    },
    {
        "_id": "6619b43614559a90b1d8151b",
        "Company_name": "Amazon.com, Inc.",
        "Company_ticker": "AMZN",
        "Closed_price": 189.05,
        "Company_info": "Amazon.com, Inc. engages in the retail sale of consumer products, advertising, and subscriptions service through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Echo, Ring, Blink, and eero; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, independent publishers, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as advertising services through programs, such as sponsored ads, display, and video advertising. Additionally, the company offers Amazon Prime, a membership program. The company's products offered through its stores include merchandise and content purchased for resale and products offered by third-party sellers. It serves consumers, sellers, developers, enterprises, content creators, advertisers, and employees. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
        "Company_PE": 64.40485,
        "Company_cash_flow": 84946001920.0,
        "Company_dividend": null,
        "stock_id": 3
    },
    {
        "_id": "6619b43614559a90b1d8151c",
        "Company_name": "Alphabet Inc.",
        "Company_ticker": "GOOGL",
        "Closed_price": 159.41,
        "Company_info": "Alphabet Inc. offers various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, including ads, Android, Chrome, devices, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play and YouTube; and devices, as well as in the provision of YouTube consumer subscription services. The Google Cloud segment offers infrastructure, cybersecurity, databases, analytics, AI, and other services; Google Workspace that include cloud-based communication and collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells healthcare-related and internet services. The company was incorporated in 1998 and is headquartered in Mountain View, California.",
        "Company_PE": 27.194826,
        "Company_cash_flow": 101745999872.0,
        "Company_dividend": null,
        "stock_id": 4
    },
    {
        "_id": "6619b43614559a90b1d8151d",
        "Company_name": "Meta Platforms, Inc.",
        "Company_ticker": "META",
        "Closed_price": 523.16,
        "Company_info": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. The company was incorporated in 2004 and is headquartered in Menlo Park, California",
        "Company_PE": 34.448185,
        "Company_cash_flow": 71112998912.0,
        "Company_dividend": 2.0,
        "stock_id": 5
    },
    {
        "_id": "6619b43614559a90b1d8151e",
        "Company_name": "Berkshire Hathaway Inc.",
        "Company_ticker": "BRK-B",
        "Closed_price": 407.61,
        "Company_info": "Berkshire Hathaway Inc., through its subsidiaries, engages in the insurance, freight rail transportation, and utility businesses worldwide. The company provides property, casualty, life, accident, and health insurance and reinsurance; and operates railroad systems in North America. It also generates, transmits, stores, and distributes electricity from natural gas, coal, wind, solar, hydroelectric, nuclear, and geothermal sources; operates natural gas distribution and storage facilities, interstate pipelines, liquefied natural gas facilities, and compressor and meter stations; and holds interest in coal mining assets. In addition, the company manufactures boxed chocolates and other confectionery products; specialty chemicals, metal cutting tools, and components for aerospace and power generation applications; flooring products; insulation, roofing, and engineered products; building and engineered components; paints and coatings; and bricks and masonry products, as well as offers manufactured and site-built home construction, and related lending and financial services. Further, it provides recreational vehicles, apparel and footwear products, jewelry, and custom picture framing products, as well as alkaline batteries; castings, forgings, fasteners/fastener systems, aerostructures, and precision components; and cobalt, nickel, and titanium alloys. Additionally, the company distributes televisions and information; franchises and services quick service restaurants; distributes electronic components; and offers logistics services, grocery and foodservice distribution services, and professional aviation training and shared aircraft ownership programs. It also retails automobiles; furniture, bedding, and accessories; household appliances, electronics, and computers; jewelry, watches, crystal, china, stemware, flatware, gifts, and collectibles; kitchenware; and motorcycle clothing and equipment. The company was incorporated in 1998 and is headquartered in Omaha, Nebraska.",
        "Company_PE": 9.109103,
        "Company_cash_flow": 49195999232.0,
        "Company_dividend": null,
        "stock_id": 6
    },
    {
        "_id": "6619b43614559a90b1d8151f",
        "Company_name": "Johnson & Johnson",
        "Company_ticker": "JNJ",
        "Closed_price": 148.79,
        "Company_info": "Johnson & Johnson, together with its subsidiaries, researches, develops, manufactures, and sells various products in the healthcare field worldwide. The company's Innovative Medicine segment offers products for various therapeutic areas, such as immunology, including rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease, and psoriasis; infectious diseases comprising HIV/AIDS; neuroscience, consisting of mood disorders, neurodegenerative disorders, and schizophrenia; oncology, such as prostate cancer, hematologic malignancies, lung cancer, and bladder cancer; cardiovascular and metabolism, including thrombosis, diabetes, and macular degeneration; and pulmonary hypertension comprising pulmonary arterial hypertension through retailers, wholesalers, distributors, hospitals, and healthcare professionals for prescription use. Its MedTech segment provides Interventional Solutions, including electrophysiology products to treat heart rhythm disorders; the heart recovery portfolio, which includes technologies to treat severe coronary artery disease requiring high-risk PCI or AMI cardiogenic shock; and neurovascular care that treats hemorrhagic and ischemic stroke. this segment also offers an orthopaedics portfolio that includes products and enabling technologies that support hips, knees, trauma, spine, sports, and other; surgery portfolios comprising advanced and general surgery technologies, as well as solutions for breast aesthetics, ear, nose, and throat procedures; contact lenses under the ACUVUE Brand; and TECNIS intraocular lenses for cataract surgery. It distributes its products to wholesalers, hospitals, and retailers, as well as physicians, nurses, hospitals, eye care professionals, and clinics. Johnson & Johnson was founded in 1886 and is based in New Brunswick, New Jersey.",
        "Company_PE": 28.423893,
        "Company_cash_flow": 22791000064.0,
        "Company_dividend": 4.76,
        "stock_id": 7
    },
    {
        "_id": "6619b43614559a90b1d81520",
        "Company_name": "Visa Inc.",
        "Company_ticker": "V",
        "Closed_price": 275.68,
        "Company_info": "Visa Inc. operates as a payment technology company in the United States and internationally. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, and click to pay services; Visa Direct, a solution that facilitates the delivery of funds to eligible cards, deposit accounts, and digital wallets; Visa B2B Connect, a multilateral business-to-business cross-border payments network; Visa Cross-Border Solution, a cross-border consumer payments solution; and Visa DPS that provides a range of value-added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. The company also provides acceptance solutions, which include Cybersource that provides modular and value-added services for connecting merchants to payment processing; risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Risk and Decision Manager, Visa Consumer Authentication Service, and payment-decisioning solutions for fraud prevention; and Visa Consulting and Analytics, a payment consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, V PAY, and PLUS brand names. The company serves merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
        "Company_PE": 31.792625,
        "Company_cash_flow": 20198000640.0,
        "Company_dividend": 2.08,
        "stock_id": 8
    },
    {
        "_id": "6619b43614559a90b1d81521",
        "Company_name": "The Procter & Gamble Company",
        "Company_ticker": "PG",
        "Closed_price": 155.84,
        "Company_info": "The Procter & Gamble Company provides branded consumer packaged goods worldwide. It operates through five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments under the Head & Shoulders, Herbal Essences, Pantene, and Rejoice brands; and antiperspirants and deodorants, personal cleansing, and skin care products under the Olay, Old Spice, Safeguard, Secret, and SK-II brands. The Grooming segment provides shave care products and appliances under the Braun, Gillette, and Venus brand names. The Health Care segment offers toothbrushes, toothpastes, and other oral care products under the Crest and Oral-B brand names; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Metamucil, Neurobion, Pepto-Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents under the Ariel, Downy, Gain, and Tide brands; and air care, dish care, P&G professional, and surface care products under the Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment offers baby wipes, taped diapers, and pants under the Luvs and Pampers brands; adult incontinence and feminine care products under the Always, Always Discreet, and Tampax brands; and paper towels, tissues, and toilet papers under the Bounty, Charmin, and Puffs brands. The company sells its products primarily through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, specialty beauty stores, high-frequency stores, pharmacies, electronics stores, and professional channels, as well as directly to consumers. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.",
        "Company_PE": 26.018427,
        "Company_cash_flow": 19207999488.0,
        "Company_dividend": 4.03,
        "stock_id": 9
    },
    {
        "_id": "6619b43614559a90b1d81522",
        "Company_name": "JPMorgan Chase & Co.",
        "Company_ticker": "JPM",
        "Closed_price": 195.43,
        "Company_info": "JPMorgan Chase & Co. operates as a financial services company worldwide. It operates through four segments: Consumer & Community Banking (CCB), Corporate & Investment Bank (CIB), Commercial Banking (CB), and Asset & Wealth Management (AWM). The CCB segment offers deposit, investment and lending products, cash management, and payments and services; mortgage origination and servicing activities; residential mortgages and home equity loans; and credit cards, auto loans, leases, and travel services to consumers and small businesses through bank branches, ATMs, and digital and telephone banking. The CIB segment provides investment banking products and services, including corporate strategy and structure advisory, and equity and debt market capital-raising services, as well as loan origination and syndication; payments; and cash and derivative instruments, risk management solutions, prime brokerage, and research. This segment also offers securities services, including custody, fund accounting and administration, and securities lending products for asset managers, insurance companies, and public and private investment funds. The CB segment provides financial solutions, including lending, payments, investment banking, and asset management to small and midsized companies, local governments, nonprofit clients, and large corporations, as well as investors, developers, and owners of multifamily, office, retail, industrial, and affordable housing properties. The AWM segment offers multi-asset investment management solutions in equities, fixed income, alternatives, and money market funds to institutional clients and retail investors; and retirement products and services, brokerage, custody, estate planning, lending, deposits, and investment management products to high net worth clients. JPMorgan Chase & Co. was founded in 1799 and is headquartered in New York, New York.",
        "Company_PE": 11.269421,
        "Company_cash_flow": 12974000128.0,
        "Company_dividend": 4.6,
        "stock_id": 10
    },
    {
        "_id": "6619b43614559a90b1d81523",
        "Company_name": "Tesla, Inc.",
        "Company_ticker": "TSLA",
        "Closed_price": 174.6,
        "Company_info": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
        "Company_PE": 39.779068,
        "Company_cash_flow": 13255999488.0,
        "Company_dividend": null,
        "stock_id": 11
    },
    {
        "_id": "6619b43614559a90b1d81524",
        "Company_name": "NVIDIA Corporation",
        "Company_ticker": "NVDA",
        "Closed_price": 906.16,
        "Company_info": "NVIDIA Corporation provides graphics and compute and networking solutions in the United States, Taiwan, China, Hong Kong, and internationally. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise workstation graphics; virtual GPU or vGPU software for cloud-based visual and virtual computing; automotive platforms for infotainment systems; and Omniverse software for building and operating metaverse and 3D internet applications. The Compute & Networking segment comprises Data Center computing platforms and end-to-end networking platforms, including Quantum for InfiniBand and Spectrum for Ethernet; NVIDIA DRIVE automated-driving platform and automotive development agreements; Jetson robotics and other embedded platforms; NVIDIA AI Enterprise and other software; and DGX Cloud software and services. The company's products are used in gaming, professional visualization, data center, and automotive markets. It sells its products to original equipment manufacturers, original device manufacturers, system integrators and distributors, independent software vendors, cloud service providers, consumer internet companies, add-in board manufacturers, distributors, automotive manufacturers and tier-1 automotive suppliers, and other ecosystem participants. NVIDIA Corporation was incorporated in 1993 and is headquartered in Santa Clara, California.",
        "Company_PE": 73.734116,
        "Company_cash_flow": 28089999360.0,
        "Company_dividend": 0.16,
        "stock_id": 12
    },
    {
        "_id": "6619b43614559a90b1d81525",
        "Company_name": "The Walt Disney Company",
        "Company_ticker": "DIS",
        "Closed_price": 117.15,
        "Company_info": "The Walt Disney Company operates as an entertainment company worldwide. It operates through three segments: Entertainment, Sports, and Experiences. The company produces and distributes film and television video streaming content under the ABC Television Network, Disney, Freeform, FX, Fox, National Geographic, and Star brand television channels, as well as ABC television stations and A+E television networks; and produces original content under the ABC Signature, Disney Branded Television, FX Productions, Lucasfilm, Marvel, National Geographic Studios, Pixar, Searchlight Pictures, Twentieth Century Studios, 20th Television, and Walt Disney Pictures banners. It also offers direct-to-consumer streaming services through Disney+, Disney+ Hotstar, Hulu, and Star+; sports-related entertainment services through ESPN, ESPN on ABC, ESPN+ DTC, and Star; sale/licensing of film and episodic content to third-party television and VOD services; theatrical, home entertainment, and music distribution services; DVD and Blu-ray discs, electronic home video licenses, and VOD rental services; staging and licensing of live entertainment events; and post-production services. In addition, the company operates theme parks and resorts comprising Walt Disney World Resort, Disneyland Resort, Disneyland Paris, Hong Kong Disneyland Resort, Shanghai Disney Resort, Disney Cruise Line, Disney Vacation Club, National Geographic Expeditions, and Adventures by Disney, as well as Aulani, a Disney resort and spa in Hawaii. It also licenses its intellectual property to a third party for operations of the Tokyo Disney Resort; licenses trade names, characters, visual, literary, and other IP for use on merchandise, published materials, and games; operates a direct-to-home satellite distribution platform; sells branded merchandise through retail, online, and wholesale businesses; and develops and publishes books, comic books, and magazines. The company was founded in 1923 and is based in Burbank, California.",
        "Company_PE": 69.944786,
        "Company_cash_flow": 13025000448.0,
        "Company_dividend": 0.9,
        "stock_id": 13
    },
    {
        "_id": "6619b43714559a90b1d81526",
        "Company_name": "Netflix, Inc.",
        "Company_ticker": "NFLX",
        "Closed_price": 628.78,
        "Company_info": "Netflix, Inc. provides entertainment services. It offers TV series, documentaries, feature films, and games across various genres and languages. The company also provides members the ability to receive streaming content through a host of internet-connected devices, including TVs, digital video players, TV set-top boxes, and mobile devices. It has operations in approximately 190 countries. The company was incorporated in 1997 and is headquartered in Los Gatos, California.",
        "Company_PE": 51.859283,
        "Company_cash_flow": 7274300928.0,
        "Company_dividend": null,
        "stock_id": 14
    },
    {
        "_id": "6619b43714559a90b1d81527",
        "Company_name": "Pfizer Inc.",
        "Company_ticker": "PFE",
        "Closed_price": 26.34,
        "Company_info": "Pfizer Inc. discovers, develops, manufactures, markets, distributes, and sells biopharmaceutical products in the United States, Europe, and internationally. The company offers medicines and vaccines in various therapeutic areas, including cardiovascular metabolic, migraine, and women's health under the Eliquis, Nurtec ODT/Vydura, Zavzpret, and the Premarin family brands; infectious diseases with unmet medical needs under the Prevnar family, Abrysvo, Nimenrix, FSME/IMMUN-TicoVac, and Trumenba brands; and COVID-19 prevention and treatment, and potential future mRNA and antiviral products under the Comirnaty and Paxlovid brands. It also provides medicines and vaccines in various therapeutic areas, such as biosimilars for chronic immune and inflammatory diseases under the Xeljanz, Enbrel, Inflectra, Litfulo, Velsipity, and Cibinqo brands; amyloidosis, hemophilia, endocrine diseases, and sickle cell disease under the Vyndaqel family, Oxbryta, BeneFIX, Somavert, Ngenla, and Genotropin brands; sterile injectable and anti-infective medicines under the Sulperazon, Medrol, Zavicefta, Zithromax, and Panzyga brands; and biologics, small molecules, immunotherapies, and biosimilars under the Ibrance, Xtandi, Inlyta, Bosulif, Mektovi, Padcev, Adcetris, Talzenna, Tukysa, Elrexfio, Tivdak, Lorbrena, and Braftovi brands. In addition, the company involved in the contract manufacturing business. It serves wholesalers, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, retail pharmacies, and integrated delivery systems. The company has collaboration agreements with Bristol-Myers Squibb Company; Astellas Pharma US, Inc.; Merck KGaA; and BioNTech SE. Pfizer Inc. was founded in 1849 and is headquartered in New York, New York.",
        "Company_PE": 69.89189,
        "Company_cash_flow": 8700000256.0,
        "Company_dividend": 1.68,
        "stock_id": 15
    },
    {
        "_id": "6619b43714559a90b1d81528",
        "Company_name": "The Coca-Cola Company",
        "Company_ticker": "KO",
        "Closed_price": 59.05,
        "Company_info": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, caffeine free Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
        "Company_PE": 23.59514,
        "Company_cash_flow": 11598999552.0,
        "Company_dividend": 1.94,
        "stock_id": 16
    },
    {
        "_id": "6619b43714559a90b1d81529",
        "Company_name": "NIKE, Inc.",
        "Company_ticker": "NKE",
        "Closed_price": 92.0,
        "Company_info": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, accessories, and services worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. It also sells a line of performance equipment and accessories comprising bags, sport balls, socks, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. In addition, the company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel; and licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
        "Company_PE": 27.058823,
        "Company_cash_flow": 7063000064.0,
        "Company_dividend": 1.48,
        "stock_id": 17
    },
    {
        "_id": "6619b43714559a90b1d8152a",
        "Company_name": "Exxon Mobil Corporation",
        "Company_ticker": "XOM",
        "Closed_price": 121.79,
        "Company_info": "Exxon Mobil Corporation engages in the exploration and production of crude oil and natural gas in the United States and internationally. It operates through Upstream, Energy Products, Chemical Products, and Specialty Products segments. The Upstream segment explores for and produces crude oil and natural gas. The Energy Products segment offers fuels, aromatics, and catalysts, as well as licensing services. It sells its products under the Exxon, Esso, and Mobil brands. The Chemical Products segment manufactures and markets petrochemicals including olefins, polyolefins, and intermediates. The Specialty Products segment offers performance products, including lubricants, basestocks, waxes, synthetics, elastomers, and resins. The company also involves in the manufacturing, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and pursuit lower-emission business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, and lithium. Exxon Mobil Corporation was founded in 1870 and is based in Spring, Texas.",
        "Company_PE": 13.539932,
        "Company_cash_flow": 55368998912.0,
        "Company_dividend": 3.8,
        "stock_id": 18
    },
    {
        "_id": "6619b43714559a90b1d8152b",
        "Company_name": "Chevron Corporation",
        "Company_ticker": "CVX",
        "Closed_price": 161.89,
        "Company_info": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; processing, liquefaction, transportation, and regasification of liquefied natural gas; transportation of crude oil through pipelines; transportation, storage, and marketing of natural gas; and carbon capture and storage, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels, commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives; and transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.",
        "Company_PE": 13.992959,
        "Company_cash_flow": 35609001984.0,
        "Company_dividend": 6.52,
        "stock_id": 19
    },
    {
        "_id": "6619b43714559a90b1d8152c",
        "Company_name": "Cisco Systems, Inc.",
        "Company_ticker": "CSCO",
        "Closed_price": 49.53,
        "Company_info": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; wireless products include wireless access points and controllers; and compute portfolio including the cisco unified computing system, hyperflex, and software management capabilities, which combine computing, networking, and storage infrastructure management and virtualization. In addition, it provides Internet for the future product consists of routed optical networking, 5G, silicon, and optics solutions; collaboration products, such as meetings, collaboration devices, calling, contact center, and communication platform as a service; end-to-end security product consists of network security, cloud security, security endpoints, unified threat management, and zero trust; and optimized application experiences products including full stack observability and network assurance. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.",
        "Company_PE": 14.738603,
        "Company_cash_flow": 14364000256.0,
        "Company_dividend": 1.6,
        "stock_id": 20
    },
    {
        "_id": "6619b43714559a90b1d8152d",
        "Company_name": "Intel Corporation",
        "Company_ticker": "INTC",
        "Closed_price": 37.63,
        "Company_info": "Intel Corporation designs, develops, manufactures, markets, and sells computing and related products and services worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, and Intel Foundry Services segments. The company's products portfolio comprises central processing units and chipsets, system-on-chips (SoCs), and multichip packages; mobile and desktop processors; hardware products comprising graphics processing units (GPUs), domain-specific accelerators, and field programmable gate arrays (FPGAs); and memory and storage, connectivity and networking, and other semiconductor products. It also offers silicon devices and software products; and optimization solutions for workloads, such as AI, cryptography, security, storage, networking, and leverages various features supporting diverse compute environments. In addition, the company develops and deploys advanced driver assistance systems (ADAS), and autonomous driving technologies and solutions; and provides advanced process technologies backed by an ecosystem of IP, EDA, and design services, as well as systems of chips, including advanced packaging technologies, software and accelerate bring-up, and integration of chips and driving standards. Further, it delivers and deploys intelligent edge platforms that allow developers to achieve agility and drive automation using AI for efficient operations with data integrity, as well as provides hardware and software platforms, tools, and ecosystem partnerships for digital transformation from the cloud to edge. The company serves original equipment manufacturers, original design manufacturers, cloud service providers, and other manufacturers and service providers. It has a strategic agreement with Synopsys, Inc. to develop EDA and IP solutions; and ARM that enables chip designers to build optimized compute SoCs on the Intel 18A process. Intel Corporation was incorporated in 1968 and is headquartered in Santa Clara, California.",
        "Company_PE": 89.225,
        "Company_cash_flow": 11470999552.0,
        "Company_dividend": 0.5,
        "stock_id": 21
    },
    {
        "_id": "6619b43714559a90b1d8152e",
        "Company_name": "Walmart Inc.",
        "Company_ticker": "WMT",
        "Closed_price": 60.09,
        "Company_info": "Walmart Inc. engages in the operation of retail, wholesale, other units, and eCommerce worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com.mx, walmart.ca, flipkart.com, PhonePe and other sites; and mobile commerce applications. The company offers grocery and consumables, including dairy, meat, bakery, deli, produce, dry, chilled or frozen packaged foods, alcoholic and nonalcoholic beverages, floral, snack foods, candy, other grocery items, health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items; fuel, tobacco and other categories. It is also involved in the provision of health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products; and home and apparel including home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses and tire and battery centers. In addition, the company offers consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. Additionally, the company markets lines of merchandise under private brands, including Allswell, Athletic Works, Equate, and Free Assembly. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.",
        "Company_PE": 31.486912,
        "Company_cash_flow": 35726000128.0,
        "Company_dividend": 0.83,
        "stock_id": 22
    },
    {
        "_id": "6619b43714559a90b1d8152f",
        "Company_name": "AT&T Inc.",
        "Company_ticker": "T",
        "Closed_price": 16.42,
        "Company_info": "AT&T Inc. provides telecommunications and technology services worldwide. The company operates through two segments, Communications and Latin America. The Communications segment offers wireless voice and data communications services; and sells handsets, wireless data cards, wireless computing devices, carrying cases/protective covers, and wireless chargers through its own company-owned stores, agents, and third-party retail stores. It also provides Virtual Private Networks, AT&T Dedicated Internet, Ethernet, data services, cloud solutions, outsourcing, and managed professional services, as well as customer premises equipment for multinational corporations, small and mid-sized businesses, governmental, and wholesale customers. In addition, this segment offers broadband services, including fiber connections, legacy telephony voice communication services, and other VoIP services and equipment to residential customers. This segment markets its communications services and products under the AT&T, AT&T Business, Cricket, AT&T PREPAID, and AT&T Fiber brand names. The Latin America segment provides postpaid and prepaid wireless services in Mexico under the AT&T and Unefon brand names, as well as sells smartphones through its owned stores, agents and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in 2005. AT&T Inc. was incorporated in 1983 and is based in Dallas, Texas.",
        "Company_PE": 8.279187,
        "Company_cash_flow": 38314000384.0,
        "Company_dividend": 1.11,
        "stock_id": 23
    },
    {
        "_id": "6619b43814559a90b1d81530",
        "Company_name": "Verizon Communications Inc.",
        "Company_ticker": "VZ",
        "Closed_price": 40.16,
        "Company_info": "Verizon Communications Inc., through its subsidiaries, engages in the provision of communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. It operates in two segments, Verizon Consumer Group (Consumer) and Verizon Business Group (Business). The Consumer segment provides wireless services across the wireless networks in the United States under the Verizon and TracFone brands and through wholesale and other arrangements; and fixed wireless access (FWA) broadband through its wireless networks, as well as related equipment and devices, such as smartphones, tablets, smart watches, and other wireless-enabled connected devices. The segment also offers wireline services in the Mid-Atlantic and Northeastern United States, as well as Washington D.C. through its fiber-optic network, Verizon Fios product portfolio, and a copper-based network. The Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and conferencing, corporate networking, security and managed network, local and long-distance voice, and network access services to deliver various IoT services and products to businesses, government customers, and wireless and wireline carriers in the United States and internationally. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.",
        "Company_PE": 14.443637,
        "Company_cash_flow": 37475000320.0,
        "Company_dividend": 2.66,
        "stock_id": 24
    },
    {
        "_id": "6619b43814559a90b1d81531",
        "Company_name": "UnitedHealth Group Incorporated",
        "Company_ticker": "UNH",
        "Closed_price": 441.72,
        "Company_info": "UnitedHealth Group Incorporated operates as a diversified health care company in the United States. The company operates through four segments: UnitedHealthcare, Optum Health, Optum Insight, and Optum Rx. The UnitedHealthcare segment offers consumer-oriented health benefit plans and services for national employers, public sector employers, mid-sized employers, small businesses, and individuals; health care coverage, and health and well-being services to individuals age 50 and older addressing their needs; Medicaid plans, children's health insurance and health care programs; and health and dental benefits, and hospital and clinical services, as well as health care benefits products and services to state programs caring for the economically disadvantaged, medically underserved, and those without the benefit of employer-funded health care coverage. The Optum Health segment provides care delivery, care management, wellness and consumer engagement, and health financial services patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities. The Optum Insight segment offers software and information products, advisory consulting arrangements, and managed services outsourcing contracts to hospital systems, physicians, health plans, governments, life sciences companies, and other organizations. The Optum Rx segment provides pharmacy care services and programs, including retail network contracting, home delivery, specialty and community health pharmacy services, infusion, and purchasing and clinical capabilities, as well as develops programs in the areas of step therapy, formulary management, drug adherence, and disease/drug therapy management. UnitedHealth Group Incorporated was founded in 1974 and is based in Minnetonka, Minnesota.",
        "Company_PE": 18.415094,
        "Company_cash_flow": 29067999232.0,
        "Company_dividend": 7.52,
        "stock_id": 25
    },
    {
        "_id": "6619b43814559a90b1d81532",
        "Company_name": "The Home Depot, Inc.",
        "Company_ticker": "HD",
        "Closed_price": 347.37,
        "Company_info": "The Home Depot, Inc. operates as a home improvement retailer in the United States and internationally. It sells various building materials, home improvement products, lawn and garden products, and décor products, as well as facilities maintenance, repair, and operations products. The company also offers installation services for flooring, water heaters, bath, garage doors, cabinets, cabinet makeovers, countertops, sheds, furnaces and central air systems, and windows. In addition, it provides tool and equipment rental services. The company primarily serves homeowners; and professional renovators/remodelers, general contractors, maintenance professionals, handymen, property managers, and building service contractors, as well as specialty tradesmen, such as electricians, plumbers, and painters. It sells its products through websites, including homedepot.com; homedepot.ca and homedepot.com.mx; blinds.com, justblinds.com, and americanblinds.com for custom window coverings; thecompanystore.com, an online site for textiles and décor products; hdsupply.com for maintenance, repair, and operations (MRO) products and related services; and The Home Depot stores. The Home Depot, Inc. was incorporated in 1978 and is headquartered in Atlanta, Georgia.",
        "Company_PE": 22.691595,
        "Company_cash_flow": 21172000768.0,
        "Company_dividend": 9.0,
        "stock_id": 26
    },
    {
        "_id": "6619b43814559a90b1d81533",
        "Company_name": "McDonald's Corporation",
        "Company_ticker": "MCD",
        "Closed_price": 268.62,
        "Company_info": "McDonald's Corporation operates and franchises restaurants under the McDonald's brand in the United States and internationally. It offers food and beverages, including hamburgers and cheeseburgers, various chicken sandwiches, fries, shakes, desserts, sundaes, cookies, pies, soft drinks, coffee, and other beverages; and full or limited breakfast, as well as sells various other products during limited-time promotions. The company owns and operates under various structures comprising conventional franchise, developmental license, or affiliate. McDonald's Corporation was founded in 1940 and is based in Chicago, Illinois.",
        "Company_PE": 23.15065,
        "Company_cash_flow": 9611899904.0,
        "Company_dividend": 6.68,
        "stock_id": 27
    },
    {
        "_id": "6619b43814559a90b1d81534",
        "Company_name": "The Boeing Company",
        "Company_ticker": "BA",
        "Closed_price": 173.36,
        "Company_info": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through Commercial Airplanes; Defense, Space & Security; and Global Services segments. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Company was incorporated in 1916 and is based in Arlington, Virginia.",
        "Company_PE": null,
        "Company_cash_flow": 5960000000.0,
        "Company_dividend": null,
        "stock_id": 28
    },
    {
        "_id": "6619b43814559a90b1d81535",
        "Company_name": "3M Company",
        "Company_ticker": "MMM",
        "Closed_price": 93.18,
        "Company_info": "3M Company provides diversified technology services in the United States and internationally. The company's Safety and Industrial segment offers industrial abrasives and finishing for metalworking applications; autobody repair solutions; closure systems for personal hygiene products, masking, and packaging materials; electrical products and materials for construction and maintenance, power distribution, and electrical original equipment manufacturers; structural adhesives and tapes; respiratory, hearing, eye, and fall protection solutions; and natural and color-coated mineral granules for shingles. Its Transportation and Electronics segment provides ceramic solutions; attachment/bonding products, films, sound, and temperature management for transportation vehicles; premium large format graphic films for advertising and fleet signage; light management films and electronics assembly solutions; packaging and interconnection solutions; semiconductor production materials; data centers solutions; and reflective signage for highway, and vehicle safety. The company's Consumer segment provides consumer bandages, braces, supports, and consumer respirators; home cleaning products; retail abrasives, paint accessories, car care DIY products, picture hanging, and consumer air quality solutions; and stationery products. It offers its products through e-commerce and traditional wholesalers, retailers, jobbers, distributors, and dealers. 3M Company was founded in 1902 and is headquartered in Saint Paul, Minnesota.",
        "Company_PE": null,
        "Company_cash_flow": 6680000000.0,
        "Company_dividend": 6.04,
        "stock_id": 29
    },
    {
        "_id": "6619b43814559a90b1d81536",
        "Company_name": "Caterpillar Inc.",
        "Company_ticker": "CAT",
        "Closed_price": 371.98,
        "Company_info": "Caterpillar Inc. manufactures and sells construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives in worldwide. Its Construction Industries segment offers asphalt pavers, compactors, road reclaimers, forestry machines, cold planers, material handlers, track-type tractors, excavators, telehandlers, motor graders, and pipelayers; compact track, wheel, track-type, backhoe, and skid steer loaders; and related parts and tools. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, tractors, mining trucks, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers and dozers, fleet management products, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, work tools, and safety services and mining performance solutions, as well as related parts and services. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines, drivetrain, and integrated systems and solutions; turbines, centrifugal gas compressors, and related services; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, revolving charge accounts, repair/rebuild financing services, working capital loans, and wholesale financing; and insurance and risk management products and services. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; logistics solutions and distribution services; brand management and marketing strategy services; and digital investments services. Caterpillar Inc. was founded in 1925 and is headquartered in Irving, Texas.",
        "Company_PE": 18.172464,
        "Company_cash_flow": 12885000192.0,
        "Company_dividend": 5.2,
        "stock_id": 30
    },
    {
        "_id": "6619b43814559a90b1d81537",
        "Company_name": "The Goldman Sachs Group, Inc.",
        "Company_ticker": "GS",
        "Closed_price": 397.48,
        "Company_info": "The Goldman Sachs Group, Inc., a financial institution, provides a range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through Global Banking & Markets, Asset & Wealth Management, and Platform Solutions segments. The Global Banking & Markets segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and relationship lending, and acquisition financing, as well as secured lending, through structured credit and asset-backed lending and involved in financing under securities to resale agreements. This segment also offers client execution activities for cash and derivative instruments; credit and interest rate products; and provision of mortgages, currencies, commodities, and equities related products, as well as underwriting services. The Asset & Wealth Management segment manages assets across various classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, wealth advisory services, personalized financial planning, and private banking services, as well as invests in corporate equity, credit, real estate, and infrastructure assets. The Platform Solutions segment offers credit cards and point-of-sale financing for purchase of goods or services. This segment also provides cash management services, such as deposit-taking and payment solutions for corporate and institutional clients. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.",
        "Company_PE": 17.038057,
        "Company_cash_flow": -12586999808.0,
        "Company_dividend": 11.0,
        "stock_id": 31
    },
    {
        "_id": "6619b43814559a90b1d81538",
        "Company_name": "International Business Machines Corporation",
        "Company_ticker": "IBM",
        "Closed_price": 185.9,
        "Company_info": "International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through Software, Consulting, Infrastructure, and Financing segments. The Software segment offers a hybrid cloud and AI platforms that allows clients to realize their digital and AI transformations across the applications, data, and environments in which they operate. The Consulting segment focuses on skills integration for strategy, experience, technology, and operations by domain and industry. The Infrastructure segment provides on-premises and cloud based server, and storage solutions, as well as life-cycle services for hybrid cloud infrastructure deployment. The Financing segment offers client and commercial financing, facilitates IBM clients' acquisition of hardware, software, and services. The company has a strategic partnership to various companies including hyperscalers, service providers, global system integrators, and software and hardware vendors that includes Adobe, Amazon Web services, Microsoft, Oracle, Salesforce, Samsung Electronics and SAP, and others. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.",
        "Company_PE": 22.391891,
        "Company_cash_flow": 13930999808.0,
        "Company_dividend": 6.64,
        "stock_id": 32
    },
    {
        "_id": "6619b43914559a90b1d81539",
        "Company_name": "Merck & Co., Inc.",
        "Company_ticker": "MRK",
        "Closed_price": 126.15,
        "Company_info": "Merck & Co., Inc. operates as a healthcare company worldwide. It operates through two segments, Pharmaceutical and Animal Health. The Pharmaceutical segment offers human health pharmaceutical products in the areas of oncology, hospital acute care, immunology, neuroscience, virology, cardiovascular, and diabetes under the Keytruda, Bridion, Adempas, Lagevrio, Belsomra, Simponi, and Januvia brands, as well as vaccine products consisting of preventive pediatric, adolescent, and adult vaccines under the Gardasil/Gardasil 9, ProQuad, M-M-R II, Varivax, RotaTeq, Live Oral, Vaxneuvance, Pneumovax 23, and Vaqta names. The Animal Health segment discovers, develops, manufactures, and markets veterinary pharmaceuticals, vaccines, and health management solutions and services, as well as digitally connected identification, traceability, and monitoring products. The company serves drug wholesalers and retailers, hospitals, and government agencies; managed health care providers, such as health maintenance organizations, pharmacy benefit managers, and other institutions; and physicians, wholesalers, government entities, veterinarians, distributors, animal producers, farmers, and pet owners. It has development and commercialization agreement for three of Daiichi Sankyo's deruxtecan ADC candidates, which include patritumab deruxtecan, ifinatamab deruxtecan, and raludotatug deruxtecan for the treatment of multiple solid tumors both as monotherapy and/or in combination with other treatments; and AstraZeneca PLC to co-development and co-commercialize AstraZeneca's Lynparza products for multiple cancer types, and Koselugo for multiple indications. The company also has a collaboration agreement with Eisai Co., Ltd., Bayer AG, and Ridgeback Biotherapeutics LP, as well Moderna, Inc. Merck & Co., Inc. was founded in 1891 and is headquartered in Rahway, New Jersey.",
        "Company_PE": 898.1428,
        "Company_cash_flow": 13006000128.0,
        "Company_dividend": 3.08,
        "stock_id": 33
    },
    {
        "_id": "6619b43914559a90b1d8153a",
        "Company_name": "General Electric Company",
        "Company_ticker": "GE",
        "Closed_price": 157.4,
        "Company_info": "General Electric Company, doing business as GE Aerospace, designs and produces commercial and defense aircraft engines, integrated engine components, electric power, and mechanical aircraft systems. It also offers aftermarket services to support its products. The company operates in the United States, Europe, China, Asia, the Americas, the Middle East, and Africa. General Electric Company was incorporated in 1892 and is based in Evendale, Ohio.",
        "Company_PE": 19.377193,
        "Company_cash_flow": 5178999808.0,
        "Company_dividend": 1.12,
        "stock_id": 34
    },
    {
        "_id": "6619b43914559a90b1d8153b",
        "Company_name": "Ford Motor Company",
        "Company_ticker": "F",
        "Closed_price": 13.04,
        "Company_info": "Ford Motor Company develops, delivers, and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It operates through Ford Blue, Ford Model e, and Ford Pro; Ford Next; and Ford Credit segments. The company sells Ford and Lincoln vehicles, service parts, and accessories through distributors and dealers, as well as through dealerships to commercial fleet customers, daily rental car companies, and governments. It also engages in vehicle-related financing and leasing activities to and through automotive dealers. In addition, the company provides retail installment sale contracts for new and used vehicles; and direct financing leases for new vehicles to retail and commercial customers, such as leasing companies, government entities, daily rental companies, and fleet customers. Further, it offers wholesale loans to dealers to finance the purchase of vehicle inventory; and loans to dealers to finance working capital and enhance dealership facilities, purchase dealership real estate, and other dealer vehicle programs. The company was incorporated in 1903 and is based in Dearborn, Michigan.",
        "Company_PE": 11.675925,
        "Company_cash_flow": 14917999616.0,
        "Company_dividend": 0.6,
        "stock_id": 35
    },
    {
        "_id": "6619b43914559a90b1d8153c",
        "Company_name": "General Motors Company",
        "Company_ticker": "GM",
        "Closed_price": 43.84,
        "Company_info": "General Motors Company designs, builds, and sells trucks, crossovers, cars, and automobile parts; and provide software-enabled services and subscriptions worldwide. The company operates through GM North America, GM International, Cruise, and GM Financial segments. It markets its vehicles primarily under the Buick, Cadillac, Chevrolet, GMC, Baojun, and Wuling brand names. In addition, the company sells trucks, crossovers, cars, and automobile parts through retail dealers, and distributors and dealers, as well as to fleet customers, including daily rental car companies, commercial fleet customers, leasing companies, and governments. Further, it offers range of after-sale services through dealer network, such as maintenance, light repairs, collision repairs, vehicle accessories, and extended service warranties. Additionally, the company provides automotive financing; and software-enabled services and subscriptions. General Motors Company was founded in 1908 and is headquartered in Detroit, Michigan.",
        "Company_PE": 5.885246,
        "Company_cash_flow": 20930000896.0,
        "Company_dividend": 0.48,
        "stock_id": 36
    },
    {
        "_id": "6619b43914559a90b1d8153d",
        "Company_name": "Adobe Inc.",
        "Company_ticker": "ADBE",
        "Closed_price": 484.28,
        "Company_info": "Adobe Inc., together with its subsidiaries, operates as a diversified software company worldwide. It operates through three segments: Digital Media, Digital Experience, and Publishing and Advertising. The Digital Media segment offers products, services, and solutions that enable individuals, teams, and enterprises to create, publish, and promote content; and Document Cloud, a unified cloud-based document services platform. Its flagship product is Creative Cloud, a subscription service that allows members to access its creative products. This segment serves content creators, students, workers, marketers, educators, enthusiasts, and communicators. The Digital Experience segment provides an integrated platform and set of applications and services that enable brands and businesses to create, manage, execute, measure, monetize, and optimize customer experiences from analytics to commerce. This segment serves marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers, and executives across the C-suite. The Publishing and Advertising segment offers products and services, such as e-learning solutions, technical document publishing, web conferencing, document and forms platform, web application development, and high-end printing, as well as Advertising Cloud offerings. It also provides consulting, technical support, and learning services. The company offers its products and services directly to enterprise customers through its sales force and local field offices, as well as to end users through app stores and through its website at adobe.com. It also distributes products and services through distributors, value-added resellers, systems integrators, software vendors and developers, retailers, and original equipment manufacturers. The company was formerly known as Adobe Systems Incorporated and changed its name to Adobe Inc. in October 2018. Adobe Inc. was founded in 1982 and is headquartered in San Jose, California.",
        "Company_PE": 45.324093,
        "Company_cash_flow": 6783000064.0,
        "Company_dividend": null,
        "stock_id": 37
    },
    {
        "_id": "6619b43914559a90b1d8153e",
        "Company_name": "Salesforce, Inc.",
        "Company_ticker": "CRM",
        "Closed_price": 299.15,
        "Company_info": "Salesforce, Inc. provides Customer Relationship Management (CRM) technology that brings companies and customers together worldwide. The company's service includes sales to store data, monitor leads and progress, forecast opportunities, gain insights through analytics and artificial intelligence, and deliver quotes, contracts, and invoices; and service that enables companies to deliver trusted and highly personalized customer support at scale. In addition, its platform offering comprise a flexible platform that enables companies of various sizes, locations, and industries to build business workflow and apps with customer; online learning platform that allows anyone to learn in-demand Salesforce skills; and Slack, an intelligent productivity platform. The company's marketing services enables companies to plan, personalize, automate, and optimize customer marketing journey, connecting interaction, and connected products; and commerce services, which empowers shopping experience across various customer touchpoint, such as mobile, web, social, and stores and provides click-to-code tools that offers customers to build and deploy solutions. Further, its analytics offering includes Tableau, an end-to-end analytics solution for range of enterprise use cases and intelligent analytics with AI models, spot trends, predict outcomes, creates summaries, timely recommendations, and take action from any device; and integration service including MuleSoft, which provides building blocks to deliver end-to-end and connected experiences. Additionally, the company provides data cloud, a hyperscale data engine native to Salesforce; vertical services to meet the needs of customers in industries, such as financial services, healthcare and life sciences, manufacturing and automotive and government; and offers salesforce starter for small and medium-sized businesses. Salesforce, Inc. was incorporated in 1999 and is headquartered in San Francisco, California.",
        "Company_PE": 70.24344,
        "Company_cash_flow": 10234000384.0,
        "Company_dividend": 1.6,
        "stock_id": 38
    },
    {
        "_id": "6619b43914559a90b1d8153f",
        "Company_name": "Oracle Corporation",
        "Company_ticker": "ORCL",
        "Closed_price": 123.24,
        "Company_info": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Cerner healthcare, Oracle Advertising, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database and MySQL Database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database, MySQL HeatWave, Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. The company has a collaboration with Amdocs Limited to empower customers on their journey towards cloud and digital adoption. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
        "Company_PE": 31.871054,
        "Company_cash_flow": 18239000576.0,
        "Company_dividend": 1.6,
        "stock_id": 39
    },
    {
        "_id": "6619b43914559a90b1d81540",
        "Company_name": "Abbott Laboratories",
        "Company_ticker": "ABT",
        "Closed_price": 110.9,
        "Company_info": "Abbott Laboratories, together with its subsidiaries, discovers, develops, manufactures, and sells health care products worldwide. It operates in four segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices. The company provides generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency, irritable bowel syndrome or biliary spasm, intrahepatic cholestasis or depressive symptoms, gynecological disorder, hormone replacement therapy, dyslipidemia, hypertension, hypothyroidism, Ménière's disease and vestibular vertigo, pain, fever, inflammation, and migraine, as well as provides anti-infective clarithromycin, influenza vaccine, and products to regulate physiological rhythm of the colon. It also offers laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics polymerase chain reaction instrument systems that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents; point of care systems; cartridges for testing blood gas, chemistry, electrolytes, coagulation, and immunoassay; rapid diagnostics lateral flow testing products; molecular point-of-care testing for HIV, SARS-CoV-2, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test, and remote patient monitoring and consumer self-test systems; and informatics and automation solutions for laboratories. In addition, the company provides pediatric and adult nutritional products; rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases; diabetes care products, such as glucose and blood glucose monitoring systems; and neuromodulation devices for the management of chronic pain and movement disorders. Abbott Laboratories was founded in 1888 and is based in North Chicago, Illinois.",
        "Company_PE": 33.366974,
        "Company_cash_flow": 7261000192.0,
        "Company_dividend": 2.2,
        "stock_id": 40
    },
    {
        "_id": "6619b43914559a90b1d81541",
        "Company_name": "Bank of America Corporation",
        "Company_ticker": "BAC",
        "Closed_price": 36.35,
        "Company_info": "Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. It operates in four segments: Consumer Banking, Global Wealth & Investment Management (GWIM), Global Banking, and Global Markets. The Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, non-interest and interest-bearing checking accounts, and investment accounts and products; credit and debit cards; residential mortgages, and home equity loans; and direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The GWIM segment provides investment management, brokerage, banking, and trust and retirement products and services; wealth management solutions; and customized solutions, including specialty asset management services. The Global Banking segment offers lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, short-term investing options, and merchant services; working capital management solutions; debt and equity underwriting and distribution, and merger-related and other advisory services; and fixed-income and equity research, and certain market-based services. The Global Markets segment provides market-making, financing, securities clearing, settlement, and custody services; securities and derivative products; and risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. Bank of America Corporation was founded in 1784 and is based in Charlotte, North Carolina.",
        "Company_PE": 11.620131,
        "Company_cash_flow": 44982001664.0,
        "Company_dividend": 0.96,
        "stock_id": 41
    },
    {
        "_id": "6619b43914559a90b1d81542",
        "Company_name": "Citigroup Inc.",
        "Company_ticker": "C",
        "Closed_price": 60.71,
        "Company_info": "Citigroup Inc., a diversified financial service holding company, provides various financial product and services to consumers, corporations, governments, and institutions worldwide. It operates through five segments: Services, Markets, Banking, U.S. Personal Banking, and Wealth. The Services segment includes Treasury and Trade Solutions, which provides cash management, trade, and working capital solutions to multinational corporations, financial institutions, and public sector organizations; and Securities Services, such as cross-border support for clients, local market expertise, post-trade technologies, data solutions, and various securities services solutions. The Markets segment offers sales and trading services for equities, foreign exchange, rates, spread products, and commodities to corporate, institutional, and public sector clients; and market-making services, including asset classes, risk management solutions, financing, prime brokerage, research, securities clearing, and settlement. The banking segment includes investment banking; advisory services related to mergers and acquisitions, divestitures, restructurings, and corporate defense activities; and corporate lending, which includes corporate and commercial banking. The U.S. Personal Banking segment provides co-branded cards and retail banking services. The Wealth segment provides financial services to high-net-worth clients through banking, lending, mortgages, investment, custody, and trust product offerings; and to professional industries, including law firms, consulting groups, accounting, and asset management. The company was founded in 1812 and is headquartered in New York, New York.",
        "Company_PE": 14.772278,
        "Company_cash_flow": -73415999488.0,
        "Company_dividend": 2.12,
        "stock_id": 42
    },
    {
        "_id": "6619b43914559a90b1d81543",
        "Company_name": "Gilead Sciences, Inc.",
        "Company_ticker": "GILD",
        "Closed_price": 68.65,
        "Company_info": "Gilead Sciences, Inc., a biopharmaceutical company, discovers, develops, and commercializes medicines in the areas of unmet medical need in the United States, Europe, and internationally. The company provides Biktarvy, Genvoya, Descovy, Odefsey, Truvada, Complera/ Eviplera, Stribild, Sunlencs, and Atripla products for the treatment of HIV/AIDS; Veklury, an injection for intravenous use, for the treatment of COVID-19; and Epclusa, Harvoni, Vemlidy, and Viread for the treatment of viral hepatitis. It also offers Yescarta, Tecartus, and Trodelvy products for the treatment of oncology; Letairis, an oral formulation for the treatment of pulmonary arterial hypertension; and AmBisome, a liposomal formulation for the treatment of serious invasive fungal infections. The company has collaboration agreements with Arcus Biosciences, Inc.; Merck Sharp & Dohme Corp.; Pionyr Immunotherapeutics Inc.; Tizona Therapeutics, Inc.; Galapagos NV; Janssen Sciences Ireland Unlimited Company; Japan Tobacco, Inc.; Dragonfly Therapeutics, Inc.; Arcellx, Inc.; Everest Medicines; Merck & Co, Inc.; Tentarix Biotherapeutics Inc.; and Assembly Biosciences, Inc. It also has research collaboration, option, and license agreement with Merus N.V. for the discovery of novel dual tumor-associated antigens (TAA) targeting trispecific antibodies. The company was incorporated in 1987 and is headquartered in Foster City, California.",
        "Company_PE": 15.126667,
        "Company_cash_flow": 8006000128.0,
        "Company_dividend": 3.08,
        "stock_id": 43
    },
    {
        "_id": "6619b43914559a90b1d81544",
        "Company_name": "Eli Lilly and Company",
        "Company_ticker": "LLY",
        "Closed_price": 759.59,
        "Company_info": "Eli Lilly and Company discovers, develops, and markets human pharmaceuticals worldwide. The company offers Basaglar, Humalog, Humalog Mix 75/25, Humalog U-100, Humalog U-200, Humalog Mix 50/50, insulin lispro, insulin lispro protamine, insulin lispro mix 75/25, Humulin, Humulin 70/30, Humulin N, Humulin R, and Humulin U-500 for diabetes; Jardiance, Mounjaro, and Trulicity for type 2 diabetes; and Zepbound for obesity. It also provides oncology products, including Alimta, Cyramza, Erbitux, Jaypirca, Retevmo, Tyvyt, and Verzenio. In addition, the company offers Olumiant for rheumatoid arthritis, atopic dermatitis, severe alopecia areata, and COVID-19; Taltz for plaque psoriasis, psoriatic arthritis, ankylosing spondylitis, and non-radiographic axial spondylarthritis; Omvoh for ulcerative colitis; Cymbalta for depressive disorder, diabetic peripheral neuropathic pain, generalized anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; Ebglyss for severe atopic dermatitis; and Emgality for migraine prevention and episodic cluster headache. Further, it provides Cialis for erectile dysfunction and benign prostatic hyperplasia; and Forteo for osteoporosis. It has collaborations with Incyte Corporation; Boehringer Ingelheim Pharmaceuticals, Inc.; F. Hoffmann-La Roche Ltd and Genentech, Inc.; Biologics, Inc., AbCellera Biologics Inc.; and Chugai Pharmaceutical Co., Ltd. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.",
        "Company_PE": 130.2669,
        "Company_cash_flow": 4240100096.0,
        "Company_dividend": 5.2,
        "stock_id": 44
    },
    {
        "_id": "6619b43a14559a90b1d81545",
        "Company_name": "Medtronic plc",
        "Company_ticker": "MDT",
        "Closed_price": 82.17,
        "Company_info": "Medtronic plc develops, manufactures, and sells device-based medical therapies to healthcare systems, physicians, clinicians, and patients worldwide. Its Cardiovascular Portfolio segment offers implantable cardiac pacemakers, cardioverter defibrillators, and cardiac resynchronization therapy devices; cardiac ablation products; insertable cardiac monitor systems; TYRX products; and remote monitoring and patient-centered software. It also provides aortic valves, surgical valve replacement and repair products, endovascular stent grafts and accessories, and transcatheter pulmonary valves; and percutaneous coronary intervention products, percutaneous angioplasty balloons, and products. The company's Medical Surgical Portfolio segment offers surgical stapling devices, vessel sealing instruments, wound closure, electrosurgery products, surgical artificial intelligence and robotic-assisted surgery products, hernia mechanical devices, mesh implants, gynecology and lung products, and various therapies to treat diseases, as well as products in the fields of minimally invasive gastrointestinal and hepatologic diagnostics and therapies, patient monitoring, airway management and ventilation therapies, and renal disease. Its Neuroscience Portfolio segment offers products for spinal surgeons; neurosurgeons; neurologists; pain management specialists; anesthesiologists; orthopedic surgeons; urologists; urogynecologists; interventional radiologists; ear, nose, and throat specialists; and systems that incorporate energy surgical instruments. It also provides image-guided surgery and intra-operative imaging systems and robotic guidance systems used in robot assisted spine procedures; and therapies for vasculature in and around the brain. The company's Diabetes Operating Unit segment offers insulin pumps and consumables, continuous glucose monitoring systems, smart insulin pen systems, and consumables and supplies. The company was founded in 1949 and is headquartered in Dublin, Ireland.",
        "Company_PE": 25.438093,
        "Company_cash_flow": 6470000128.0,
        "Company_dividend": 2.76,
        "stock_id": 45
    },
    {
        "_id": "6619b43a14559a90b1d81546",
        "Company_name": "Amgen Inc.",
        "Company_ticker": "AMGN",
        "Closed_price": 270.0,
        "Company_info": "Amgen Inc. discovers, develops, manufactures, and delivers human therapeutics worldwide. The company's principal products include Enbrel to treat plaque psoriasis, rheumatoid arthritis, and psoriatic arthritis; Otezla for the treatment of adult patients with plaque psoriasis, psoriatic arthritis, and oral ulcers associated with Behçet's disease; Prolia to treat postmenopausal women with osteoporosis; XGEVA for skeletal-related events prevention; Repatha, which reduces the risks of myocardial infarction, stroke, and coronary revascularization; Nplate for the treatment of patients with immune thrombocytopenia; KYPROLIS to treat patients with relapsed or refractory multiple myeloma; Aranesp to treat a lower-than-normal number of red blood cells and anemia; EVENITY for the treatment of osteoporosis in postmenopausal for men and women; Vectibix to treat patients with wild-type RAS metastatic colorectal cancer; BLINCYTO for the treatment of patients with acute lymphoblastic leukemia; TEPEZZA to treat thyroid eye disease; and KRYSTEXXA for the treatment of chronic refractory gout. It also markets other products, including Neulasta, MVASI, AMJEVITA/AMGEVITA, TEZSPIRE, Parsabiv, Aimovig, LUMAKRAS/LUMYKRAS, EPOGEN, KANJINTI, TAVNEOS, RAVICTI, UPLIZNA and PROCYSBI. The company serves healthcare providers, including physicians or their clinics, dialysis centers, hospitals, and pharmacies. It distributes its products through pharmaceutical wholesale distributors, as well as direct-to-consumer channels. The company has collaboration agreements with AstraZeneca plc for the development and commercialization of TEZSPIRE; Novartis Pharma AG to develop and commercialize Aimovig; UCB for the development and commercialization of EVENITY; Kyowa Kirin Co., Ltd. for rocatinlimab development and commercialization; and BeiGene, Ltd. for oncology products expansion and development. Amgen Inc. was incorporated in 1980 and is headquartered in Thousand Oaks, California.",
        "Company_PE": 21.416668,
        "Company_cash_flow": 8471000064.0,
        "Company_dividend": 9.0,
        "stock_id": 46
    },
    {
        "_id": "6619b43a14559a90b1d81547",
        "Company_name": "Altria Group, Inc.",
        "Company_ticker": "MO",
        "Closed_price": 41.43,
        "Company_info": "Altria Group, Inc., through its subsidiaries, manufactures and sells smokeable and oral tobacco products in the United States. The company offers cigarettes primarily under the Marlboro brand; large cigars and pipe tobacco under the Black & Mild brand; moist smokeless tobacco and snus products under the Copenhagen, Skoal, Red Seal, and Husky brands; oral nicotine pouches under the on! brand; and e-vapor products under the NJOY ACE brand. It sells its products to distributors, as well as large retail organizations, such as chain stores. The company was founded in 1822 and is headquartered in Richmond, Virginia.",
        "Company_PE": 8.982494,
        "Company_cash_flow": 9287000064.0,
        "Company_dividend": 3.92,
        "stock_id": 47
    },
    {
        "_id": "6619b43a14559a90b1d81548",
        "Company_name": "PepsiCo, Inc.",
        "Company_ticker": "PEP",
        "Closed_price": 168.36,
        "Company_info": "PepsiCo, Inc. engages in the manufacture, marketing, distribution, and sale of various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products, as well as distributes alcoholic beverages under Hard MTN Dew brand. The company offers its products primarily under the Lay's, Doritos, Fritos, Tostitos, BaiCaoWei, Cheetos, Cap'n Crunch, Life, Pearl Milling Company, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Rice-A-Roni, Aquafina, Bubly, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Crush, Propel, Dr Pepper, Schweppes, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, Pepsi Max, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimyj Sad, Agusha, Chudo, Domik v Derevne, Lipton, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.",
        "Company_PE": 25.625002,
        "Company_cash_flow": 13441999872.0,
        "Company_dividend": 5.06,
        "stock_id": 48
    },
    {
        "_id": "6619b43a14559a90b1d81549",
        "Company_name": "Thermo Fisher Scientific Inc.",
        "Company_ticker": "TMO",
        "Closed_price": 574.57,
        "Company_info": "Thermo Fisher Scientific Inc. provides life sciences solutions, analytical instruments, specialty diagnostics, and laboratory products and biopharma services in the North America, Europe, Asia-Pacific, and internationally. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery, and production of drugs and vaccines, as well as diagnosis of infections and diseases; and solutions include biosciences, genetic sciences, and bio production to pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for pharmaceutical, biotechnology, academic, government, environmental, and other research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, protein detection assays, and instruments; immunodiagnostics develops, manufactures and markets complete bloodtest systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Biopharma Services segment provides laboratory products, research and safety market channel, and pharma services and clinical research. It offers products and services through a direct sales force, customer-service professionals, electronic commerce, and third-party distributors under Thermo Scientific; Applied Biosystems; Invitrogen; Fisher Scientific; Unity Lab Services; and Patheon and PPD. Thermo Fisher Scientific Inc. was founded in 1956 and is headquartered in Waltham, Massachusetts.",
        "Company_PE": 36.560802,
        "Company_cash_flow": 8406000128.0,
        "Company_dividend": 1.56,
        "stock_id": 49
    },
    {
        "_id": "6619b43a14559a90b1d8154a",
        "Company_name": "Danaher Corporation",
        "Company_ticker": "DHR",
        "Closed_price": 244.0,
        "Company_info": "Danaher Corporation designs, manufactures, and markets professional, medical, industrial, and commercial products and services worldwide. The Biotechnology segments offers bioprocess technologies, consumables, and services that advance, accelerate, and integrate the development and manufacture of therapeutics; cell line and cell culture media development services; cell culture media, process liquids and buffers for manufacturing, chromatography resins, filtration technologies, aseptic fill finish; single-use hardware and consumables and services, such as the design and installation of full manufacturing suites; lab filtration, separation, and purification; lab-scale protein purification and analytical tools; reagents, membranes, and services; and healthcare filtration solutions. The Life Sciences segment provides mass spectrometers; flow cytometry, genomics, lab automation, centrifugation, liquid handling automation instruments, antibodies and reagents, and particle counting and characterization; microscopes; protein consumables; industrial filtration products; and genomic medicines, such as custom nucleic acid products, plasmid DNA, RNA, and proteins under the ABCAM, ALDEVRON, BECKMAN COULTER, IDT, LEICA MICROSYSTEMS, MOLECULAR DEVICES, PALL, PHENOMENEX and SCIEX brands. The Diagnostics segment offers chemistry, immunoassay, microbiology, and automation systems; and molecular, acute care, and pathology diagnostics products. This segment also provides clinical instruments, reagents, consumables, software, and services for hospitals, physicians' offices, reference laboratories, and other critical care settings. The company was formerly known as Diversified Mortgage Investors, Inc. and changed its name to Danaher Corporation in 1984. Danaher Corporation was founded in 1969 and is based in Washington, the District of Columbia.",
        "Company_PE": 42.393993,
        "Company_cash_flow": 7164000256.0,
        "Company_dividend": 1.08,
        "stock_id": 50
    }
]